#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_repository.example-service will be updated in-place
  ~ resource "github_repository" "example-service" {
      ~ allow_merge_commit = false -> true
      ~ allow_rebase_merge = false -> true
      ~ allow_squash_merge = false -> true
        archived           = false
        default_branch     = "master"
        description        = "the source code for example-service"
        etag               = "W/\"4ec5ba4f678669088a3127e35eb2bdef\""
        full_name          = "sysadventco-2019/example-service"
        git_clone_url      = "git://github.com/sysadventco-2019/example-service.git"
        gitignore_template = "Rails"
        has_downloads      = false
        has_issues         = false
        has_projects       = false
        has_wiki           = false
        homepage_url       = "https://sysadvent.blogspot.com/"
        html_url           = "https://github.com/sysadventco-2019/example-service"
        http_clone_url     = "https://github.com/sysadventco-2019/example-service.git"
        id                 = "example-service"
        name               = "example-service"
        private            = false
        ssh_clone_url      = "git@github.com:sysadventco-2019/example-service.git"
        svn_url            = "https://github.com/sysadventco-2019/example-service"
        topics             = []
    }

  # github_repository_webhook.example-service-new-hook will be created
  + resource "github_repository_webhook" "example-service-new-hook" {
      + active     = false
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "example-service"
      + url        = (known after apply)

      + configuration {
          + content_type = "form"
          + insecure_ssl = "false"
          + url          = "https://web.hook.com/"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
